# This file should contain all the record creation needed to seed the database with its default values.
# The data can then be loaded with the rails db:seed command (or created alongside the database with db:setup).
#
# Examples:
#
#   movies = Movie.create([{ name: 'Star Wars' }, { name: 'Lord of the Rings' }])
#   Character.create(name: 'Luke', movie: movies.first)
[
  ['ニックネーム',    'test1@test.com', 'hoge1234', 'hoge1234', '田中', '太郎', 'タナカ', 'タロウ', 30, 4, 3, '09012345678', 1234, '123-4567', '13', '渋谷区', '渋谷1-1-1', '', '' ],
  ['ハーシェル',     'test2@test.com', 'hoge1234', 'hoge1234', '河本', '優那', 'カワモト', 'ユウナ',    43, 1, 27, '08047948027', 1234, '870-1159', '44', '大分市', '宗方台北3-20-1', '宗方台北ステーション413', '097180403'],
  ['ルドルフ',       'test3@test.com', 'hoge1234', 'hoge1234', '池本', '政志', 'イケモト', 'マサシ',   58, 10, 19, '09066463279', 1234, '333-0865', '11', '川口市', '伊刈3-3', '', '0474516116'],
  ['ブーフヴァルト',  'test4@test.com', 'hoge1234', 'hoge1234', '藤川', '凪歩', 'フジカワ', 'ナギホ',   45, 5, 29, '09070416223', 1234, '492-8122', '23', '稲沢市', '治郎丸元町1-2-9', '治郎丸元町タウン104', '0567386465'],
  ['ミース',         'test5@test.com', 'hoge1234', 'hoge1234', '久保', '俊哉', 'クボ', 'トシヤ',    52, 6, 9, '08074453552', 1234, '472-0024', '23', '知立市', '宝町2-19-14', '', '0533590501'],
  ['ジーフェルス',    'test6@test.com', 'hoge1234', 'hoge1234', '川井', '泰介', 'カワイ', 'タイスケ',  52, 2, 4, '08070110897', 1234, '957-0002', '15', '新発田市', '中谷内2-1', '', '0255451635'],
  ['ララ',           'test7@test.com', 'hoge1234', 'hoge1234', '堀川', '望美', 'ホリカワ', 'ノゾミ',   46, 10, 6, '09065982090', 1234, '344-0035', '11', '春日部市', '谷原新田1-20', '', '0445905461'],
  ['シュナイダー',    'test8@test.com', 'hoge1234', 'hoge1234', '宮内', '智也', 'ミヤウチ', 'トモヤ',  51, 1, 14, '08022933227', 1234, '671-1108', '28', '姫路市広畑区', '城山町4-11-4', '', '0788778150'],
  ['ウリ',           'test9@test.com', 'hoge1234', 'hoge1234', '長友', '有紗', 'ナガトモ', 'アリサ',   44, 9, 24, '09084419659', 1234, '771-1301', '36', '板野郡上板町', '鍛冶屋原3-13-16', '鍛冶屋原プラザ208', '0885058334'],
  ['ヴァイトリング',   'test10@test.com', 'hoge1234', 'hoge1234', '大淵', '誠', 'オオブチ', 'マコト',   25, 9, 3, '08071981216', 1234, '874-0903', '44', '別府市', '野口原3-11-18', '野口原ハイツ303', '0973092909'],
  ['ウーヴェ',        'test11@test.com', 'hoge1234', 'hoge1234', '渡部', '隆明', 'ワタナベ', 'タカアキ', 46, 7, 10, '09059330407', 1234, '738-0035', '34', '廿日市市', '宮園4-13-14', 'メゾン宮園403', '0829958681'],
  ['ブルスィヒ',       'test12@test.com', 'hoge1234', 'hoge1234', '小林', '博道', 'コバヤシ', 'ヒロミチ', 22, 2, 13, '08022199015', 1234, '779-0108', '36', '板野郡板野町', '犬伏3-15', '', '0885893984'],
  ['ギード',          'test13@test.com', 'hoge1234', 'hoge1234', '城戸', '真菜', 'キド', 'マナ',       43, 2, 20, '09049712142', 1234, '607-8232', '26', '京都市山科区', '勧修寺福岡町1-1-20', '', '0771159712'],
  ['ヴェルトハイム',   'test14@test.com', 'hoge1234', 'hoge1234', '安永', '治虫', 'ヤスナガ', 'オサム',   45, 3, 5, '08086493115', 1234, '916-0255', '18', '丹生郡越前町', '江波2-15', '', '077618541'],
  ['ハインリッヒ',     'test15@test.com', 'hoge1234', 'hoge1234', '星野', '亜実', 'ホシノ', 'アミ',     44, 6, 26, '09043533018', 1234, '689-2315', '31', '東伯郡琴浦町', '上伊勢3-10-7', '上伊勢ステージ103', '085956191'],
  ['ホーン',          'test16@test.com', 'hoge1234', 'hoge1234', '杉原', '幸太郎', 'スギハラ', 'コウタロウ', 28, 5, 7, '08023590335', 1234, '028-6851', '3', '二戸市', '浄法寺町小池4-6', '', '0194372623'],
  ['アンネ',          'test17@test.com', 'hoge1234', 'hoge1234', '宮坂', '絢', 'ミヤサカ', 'アヤ',       44, 11, 27, '09028166674', 1234, '963-8806', '7', '郡山市', '下舘野1-17-16', '', '0240338940'],
  ['ヴァイル',        'test18@test.com', 'hoge1234', 'hoge1234', '本田', '紗英', 'ホンダ', 'サエ',       54, 11, 4, '09080783275', 1234, '601-8212', '26', '京都市南区', '久世上久世町2-19-13', '久世上久世町庵417', '0779976630'],
  ['ミヒャエル',      'test19@test.com', 'hoge1234', 'hoge1234', '柳川', '正太郎', 'ヤナガワ', 'ショウタロウ', 51, 8, 12, '08021945132', 1234, '771-2502', '36', '三好郡東みよし町', '足代1-16-4', '', '0880659154'],
  ['ハート',          'test20@test.com', 'hoge1234', 'hoge1234', '小暮', '竜雄', 'コグレ', 'タツオ',     44, 7, 11, '08012395876', 1234, '300-0818', '8', '土浦市', '天川2-4-20', '', '0479697027'],
  ['ヴァレンチノ',    'test21@test.com', 'hoge1234', 'hoge1234', '平良', '雅春', 'ヒラヨシ', 'マサハル',     23, 7, 3, '08093778311', 1234, '637-0077', '29', '五條市', '大沢町1-3', 'コンフォート大沢町303', '0745160294'],
  ['タルティーニ',    'test22@test.com', 'hoge1234', 'hoge1234', '山下', '香澄', 'ヤマシタ', 'カスミ',      44, 3, 1, '09045119922', 1234, '820-0067', '40', '飯塚市', '川津4-2', '', '0926190691'],
  ['ロベルト',        'test23@test.com', 'hoge1234', 'hoge1234', '水上', '理津子', 'ミズカミ', 'リツコ',    45, 8, 5, '08055900159', 1234, '844-0014', '41', '西松浦郡有田町', '戸矢3-18-9', 'レジデンス戸矢115', '095259890'],
  ['モンテゼーモロ',  'test24@test.com', 'hoge1234', 'hoge1234', '笠原', '花楓', 'カサハラ', 'カエデ',     24, 3, 19, '09097937110', 1234, '761-4403', '37', '小豆郡小豆島町', '当浜3-4', '', '0870947103'],
  ['サラモーネ',      'test25@test.com', 'hoge1234', 'hoge1234', '桜田', '幸也', 'サクラダ', 'ユキヤ',    24, 12, 29, '08034341805', 1234, '341-0005', '11', '三郷市', '彦川戸1-4-15', '', '0451215257'],
  ['ヴィヴァルディ',  'test26@test.com', 'hoge1234', 'hoge1234', '立花', '義男', 'タチバナ', 'ヨシオ',     44, 8, 24, '08055367959', 1234, '794-0121', '38', '今治市', '玉川町鈍川2-20', 'リバーサイド玉川町鈍川113', '0892102992'],
  ['リリ',            'test27@test.com', 'hoge1234', 'hoge1234', '西本', '美紀', 'ニシモト', 'ミキ',    46, 3, 16, '09035725141', 1234, '239-0814', '14', '横須賀市', '二葉4-4', '', '0448705197'],
  ['ラキーユ',        'test28@test.com', 'hoge1234', 'hoge1234', '熊谷', '光枝', 'クマガヤ', 'ミツエ',    46, 4, 18, '08027121290', 1234, '616-8224', '26', '京都市右京区', '常盤窪町1-5-12', '', '0771764872'],
  ['シャルル',        'test29@test.com', 'hoge1234', 'hoge1234', '菊池', '優羽', 'キクチ', 'ユウ',      44, 5, 25, '08033034188', 1234, '944-0091', '15', '妙高市', '青田2-20-10', '', '0254739142'],
  ['ルベール',        'test30@test.com', 'hoge1234', 'hoge1234', '酒井', '正徳', 'サカイ', 'マサノリ',    54, 6, 28, '09028662100', 1234, '763-0031', '37', '丸亀市', '城南町1-17-12', '', '0874935907']
].each do |nickname, email, password, password_confirmation, last_name, first_name, last_name_kana, first_name_kana, birth_yyyy_id, birth_mm_id, birth_dd_id, phone_num, authentication_num, zip_code1, prefecture_id, city, address1, address2, telephone|
  User.create!(
    {
      nickname: nickname,
      email: email,
      password: password,
      password_confirmation: password_confirmation,
      last_name: last_name,
      first_name: first_name,
      last_name_kana: last_name_kana,
      first_name_kana: first_name_kana,
      birth_yyyy_id: birth_yyyy_id,
      birth_mm_id: birth_mm_id,
      birth_dd_id: birth_dd_id,
      phone_num: phone_num,
      authentication_num: authentication_num,
      zip_code1: zip_code1,
      prefecture_id: prefecture_id,
      city: city,
      address1: address1,
      address2: address2,
      telephone: telephone
    }
  )
end

[
  ['購入テスト',    'buy@test.com', 'hoge1234', 'hoge1234', '田中', '太郎', 'タナカ', 'タロウ', 30, 4, 3, '09012345678', 1234, '123-4567', '13', '渋谷区', '渋谷1-1-1', '', '' ],
  ['出品テスト',     'sell@test.com', 'hoge1234', 'hoge1234', '河本', '優那', 'カワモト', 'ユウナ',    43, 1, 27, '08047948027', 1234, '870-1159', '44', '大分市', '宗方台北3-20-1', '宗方台北ステーション413', '097180403'],
  ['ルドルフ',       'test3@test.com', 'hoge1234', 'hoge1234', '池本', '政志', 'イケモト', 'マサシ',   58, 10, 19, '09066463279', 1234, '333-0865', '11', '川口市', '伊刈3-3', '', '0474516116'],
  ['ブーフヴァルト',  'test4@test.com', 'hoge1234', 'hoge1234', '藤川', '凪歩', 'フジカワ', 'ナギホ',   45, 5, 29, '09070416223', 1234, '492-8122', '23', '稲沢市', '治郎丸元町1-2-9', '治郎丸元町タウン104', '0567386465'],
  ['ミース',         'test5@test.com', 'hoge1234', 'hoge1234', '久保', '俊哉', 'クボ', 'トシヤ',    52, 6, 9, '08074453552', 1234, '472-0024', '23', '知立市', '宝町2-19-14', '', '0533590501'],
  ['ジーフェルス',    'test6@test.com', 'hoge1234', 'hoge1234', '川井', '泰介', 'カワイ', 'タイスケ',  52, 2, 4, '08070110897', 1234, '957-0002', '15', '新発田市', '中谷内2-1', '', '0255451635'],
  ['ララ',           'test7@test.com', 'hoge1234', 'hoge1234', '堀川', '望美', 'ホリカワ', 'ノゾミ',   46, 10, 6, '09065982090', 1234, '344-0035', '11', '春日部市', '谷原新田1-20', '', '0445905461'],
  ['シュナイダー',    'test8@test.com', 'hoge1234', 'hoge1234', '宮内', '智也', 'ミヤウチ', 'トモヤ',  51, 1, 14, '08022933227', 1234, '671-1108', '28', '姫路市広畑区', '城山町4-11-4', '', '0788778150'],
  ['ウリ',           'test9@test.com', 'hoge1234', 'hoge1234', '長友', '有紗', 'ナガトモ', 'アリサ',   44, 9, 24, '09084419659', 1234, '771-1301', '36', '板野郡上板町', '鍛冶屋原3-13-16', '鍛冶屋原プラザ208', '0885058334'],
  ['ヴァイトリング',   'test10@test.com', 'hoge1234', 'hoge1234', '大淵', '誠', 'オオブチ', 'マコト',   25, 9, 3, '08071981216', 1234, '874-0903', '44', '別府市', '野口原3-11-18', '野口原ハイツ303', '0973092909'],
  ['ウーヴェ',        'test11@test.com', 'hoge1234', 'hoge1234', '渡部', '隆明', 'ワタナベ', 'タカアキ', 46, 7, 10, '09059330407', 1234, '738-0035', '34', '廿日市市', '宮園4-13-14', 'メゾン宮園403', '0829958681'],
  ['ブルスィヒ',       'test12@test.com', 'hoge1234', 'hoge1234', '小林', '博道', 'コバヤシ', 'ヒロミチ', 22, 2, 13, '08022199015', 1234, '779-0108', '36', '板野郡板野町', '犬伏3-15', '', '0885893984'],
  ['ギード',          'test13@test.com', 'hoge1234', 'hoge1234', '城戸', '真菜', 'キド', 'マナ',       43, 2, 20, '09049712142', 1234, '607-8232', '26', '京都市山科区', '勧修寺福岡町1-1-20', '', '0771159712'],
  ['ヴェルトハイム',   'test14@test.com', 'hoge1234', 'hoge1234', '安永', '治虫', 'ヤスナガ', 'オサム',   45, 3, 5, '08086493115', 1234, '916-0255', '18', '丹生郡越前町', '江波2-15', '', '077618541'],
  ['ハインリッヒ',     'test15@test.com', 'hoge1234', 'hoge1234', '星野', '亜実', 'ホシノ', 'アミ',     44, 6, 26, '09043533018', 1234, '689-2315', '31', '東伯郡琴浦町', '上伊勢3-10-7', '上伊勢ステージ103', '085956191'],
  ['ホーン',          'test16@test.com', 'hoge1234', 'hoge1234', '杉原', '幸太郎', 'スギハラ', 'コウタロウ', 28, 5, 7, '08023590335', 1234, '028-6851', '3', '二戸市', '浄法寺町小池4-6', '', '0194372623'],
  ['アンネ',          'test17@test.com', 'hoge1234', 'hoge1234', '宮坂', '絢', 'ミヤサカ', 'アヤ',       44, 11, 27, '09028166674', 1234, '963-8806', '7', '郡山市', '下舘野1-17-16', '', '0240338940'],
  ['ヴァイル',        'test18@test.com', 'hoge1234', 'hoge1234', '本田', '紗英', 'ホンダ', 'サエ',       54, 11, 4, '09080783275', 1234, '601-8212', '26', '京都市南区', '久世上久世町2-19-13', '久世上久世町庵417', '0779976630'],
  ['ミヒャエル',      'test19@test.com', 'hoge1234', 'hoge1234', '柳川', '正太郎', 'ヤナガワ', 'ショウタロウ', 51, 8, 12, '08021945132', 1234, '771-2502', '36', '三好郡東みよし町', '足代1-16-4', '', '0880659154'],
  ['ハート',          'test20@test.com', 'hoge1234', 'hoge1234', '小暮', '竜雄', 'コグレ', 'タツオ',     44, 7, 11, '08012395876', 1234, '300-0818', '8', '土浦市', '天川2-4-20', '', '0479697027'],
  ['ヴァレンチノ',    'test21@test.com', 'hoge1234', 'hoge1234', '平良', '雅春', 'ヒラヨシ', 'マサハル',     23, 7, 3, '08093778311', 1234, '637-0077', '29', '五條市', '大沢町1-3', 'コンフォート大沢町303', '0745160294'],
  ['タルティーニ',    'test22@test.com', 'hoge1234', 'hoge1234', '山下', '香澄', 'ヤマシタ', 'カスミ',      44, 3, 1, '09045119922', 1234, '820-0067', '40', '飯塚市', '川津4-2', '', '0926190691'],
  ['ロベルト',        'test23@test.com', 'hoge1234', 'hoge1234', '水上', '理津子', 'ミズカミ', 'リツコ',    45, 8, 5, '08055900159', 1234, '844-0014', '41', '西松浦郡有田町', '戸矢3-18-9', 'レジデンス戸矢115', '095259890'],
  ['モンテゼーモロ',  'test24@test.com', 'hoge1234', 'hoge1234', '笠原', '花楓', 'カサハラ', 'カエデ',     24, 3, 19, '09097937110', 1234, '761-4403', '37', '小豆郡小豆島町', '当浜3-4', '', '0870947103'],
  ['サラモーネ',      'test25@test.com', 'hoge1234', 'hoge1234', '桜田', '幸也', 'サクラダ', 'ユキヤ',    24, 12, 29, '08034341805', 1234, '341-0005', '11', '三郷市', '彦川戸1-4-15', '', '0451215257'],
  ['ヴィヴァルディ',  'test26@test.com', 'hoge1234', 'hoge1234', '立花', '義男', 'タチバナ', 'ヨシオ',     44, 8, 24, '08055367959', 1234, '794-0121', '38', '今治市', '玉川町鈍川2-20', 'リバーサイド玉川町鈍川113', '0892102992'],
  ['リリ',            'test27@test.com', 'hoge1234', 'hoge1234', '西本', '美紀', 'ニシモト', 'ミキ',    46, 3, 16, '09035725141', 1234, '239-0814', '14', '横須賀市', '二葉4-4', '', '0448705197'],
  ['ラキーユ',        'test28@test.com', 'hoge1234', 'hoge1234', '熊谷', '光枝', 'クマガヤ', 'ミツエ',    46, 4, 18, '08027121290', 1234, '616-8224', '26', '京都市右京区', '常盤窪町1-5-12', '', '0771764872'],
  ['シャルル',        'test29@test.com', 'hoge1234', 'hoge1234', '菊池', '優羽', 'キクチ', 'ユウ',      44, 5, 25, '08033034188', 1234, '944-0091', '15', '妙高市', '青田2-20-10', '', '0254739142'],
  ['ルベール',        'test30@test.com', 'hoge1234', 'hoge1234', '酒井', '正徳', 'サカイ', 'マサノリ',    54, 6, 28, '09028662100', 1234, '763-0031', '37', '丸亀市', '城南町1-17-12', '', '0874935907']
].each do |nickname, email, password, password_confirmation, last_name, first_name, last_name_kana, first_name_kana, birth_yyyy_id, birth_mm_id, birth_dd_id, phone_num, authentication_num, zip_code1, prefecture_id, city, address1, address2, telephone|
  User.create!(
    {
      nickname: nickname,
      email: email,
      password: password,
      password_confirmation: password_confirmation,
      last_name: last_name,
      first_name: first_name,
      last_name_kana: last_name_kana,
      first_name_kana: first_name_kana,
      birth_yyyy_id: birth_yyyy_id,
      birth_mm_id: birth_mm_id,
      birth_dd_id: birth_dd_id,
      phone_num: phone_num,
      authentication_num: authentication_num,
      zip_code1: zip_code1,
      prefecture_id: prefecture_id,
      city: city,
      address1: address1,
      address2: address2,
      telephone: telephone
    }
  )
end
